# words = ["gin", "zen", "gig", "msg"]
# words = ["noilq","kzlq","ydreq","ybxk","kzlq"]
words = ["yxmine","yxzd","eljys","uiaopi","pwlk"]


morze = {'a': '.-', 'b': '-...', 'c': '-.-.', 'd': '-..', 'e': '.', 'f': '..-.', 'g': '--.', 'h': '....', 'i': '..', 'j': '.---', 'k': '-.-', 'l': '.-..', 'm': '--', 'n': '-.', 'o': '---', 'p': '.--.', 'q': '--.-', 'r': '.-.', 's': '...', 't': '-', 'u': '..-', 'v': '...-', 'w': '.--', 'x': '-..-', 'y': '-.--', 'z': '--..', '/': '/'}



print(len(set(''.join([morze[letter] for letter in '/'.join(words)]).split('/'))))
















'-.---...-..--.-'
'-.---...-..--.-'
'-.---...-..--.-'
'-.---...-..--.-' # если в ручную
'-.---...-..--.--.---...-..--.-'# kzlq
# print(str(crypt['k'] + crypt['z'] + crypt['l'] + crypt['q']))





